<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [883]:
import pandas as pd
import psycopg2

In [884]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python 
DBNAME = 'project_sql'
USER = 'skillfactory'
PASSWORD = 'cCkxxLVrDE8EbvjueeMedPKt'
HOST = '84.201.134.129'
PORT = 5432

In [885]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [886]:
# текст запроса
query_3_1 = f'''select*
                from public.vacancies
                
'''

vacancies = pd.read_sql_query(query_3_1, connection)
vacancies

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

,id,name,key_skills,schedule,experience,employment,salary_from,salary_to,area_id,employer_id
0,55312386,Компьютерный Мастер,Пользователь ПК\tРабота в команде\tРемонт ноут...,Полный день,Нет опыта,Полная занятость,64000.0,NaN,1516,5724811
1,55843014,Системный администратор,Средства криптографической защиты информации\t...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,130,4903713
2,54525964,Lead Java Developer to Poland,Spring Framework\tSQL\tHibernate ORM\tJava\tGit,Удаленная работа,От 3 до 6 лет,Полная занятость,NaN,NaN,160,69961
3,54525965,Lead Java Developer to Poland,Spring Framework\tSQL\tHibernate ORM\tJava\tGit,Удаленная работа,От 3 до 6 лет,Полная занятость,NaN,NaN,159,69961
4,55354053,Специалист службы поддержки с техническими зна...,None,Удаленная работа,Нет опыта,Частичная занятость,15000.0,NaN,1955,1740
...,...,...,...,...,...,...,...,...,...,...
49192,55589514,Специалист по информационным технологиям,Электронный документооборот\t1С: Предприятие 8...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,66,5109332
49193,55029668,Руководитель процессного офиса,Оптимизация бизнес-процессов\tСтратегическое м...,Полный день,От 3 до 6 лет,Полная занятость,NaN,NaN,26,51333
49194,66172263,Начальник сервисной службы,Организаторские навыки\tУправление персоналом\...,Полный день,От 1 года до 3 лет,Полная занятость,60000.0,NaN,1930,4094700
49195,66180086,Senior IOS разработчик,Swift\tRealm\tiOS\tАнглийский язык\tMVP\tMVVM\...,Полный день,От 1 года до 3 лет,Полная занятость,146456.0,244094.0,160,4469939
49196,55547842,DataOps Engineer,None,Удаленная работа,От 3 до 6 лет,Полная занятость,NaN,NaN,160,4978627

In [887]:
# результат запроса
print(vacancies["id"].count())

49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [888]:
# текст запроса
query_3_2 = f'''select*
                from public.employers
                                
'''
employers = pd.read_sql_query(query_3_2, connection)
employers

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

            id                                               name  area
0         2393                   Программный Продукт, ИТ-компания     1
1        72977                                          БАРС Груп    88
2         3155  Бест, Торгово-производственная компания, Екате...     3
3          675                                   КОРУС Консалтинг     2
4      1840010  филиал ФКУ Налог-Сервис ФНС России в Республик...    88
...        ...                                                ...   ...
23496  1441774                                              МарКо    88
23497  4718575                                      MKomov Studio    73
23498  3702770                                  АКИБ Ипотека-банк  2759
23499  5636092                                        ГИМ-КЛИНИКА    99
23500  2064382                                             Рыббла   104

[23501 rows x 3 columns]

In [889]:
# результат запроса
print(employers["id"].count())

23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [890]:
# текст запроса
query_3_3 = f'''select*
                from public.areas
                                
'''
areas = pd.read_sql_query(query_3_3, connection)
areas

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

        id              name
0     2758           Тбилиси
1        8            Майкоп
2     1180          Нерюнгри
3     1240       Новокузнецк
4        2   Санкт-Петербург
...    ...               ...
1357  5043  Звёздный Городок
1358  3934       Воротынск\n
1359  4825             Чемал
1360  3708         Усть-Нера
1361  2432         Каневская

[1362 rows x 2 columns]

In [891]:
# результат запроса
print(areas["id"].count())

1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [892]:
# текст запроса
query_3_4 = f'''select*
                from public.industries
                                
'''
industries = pd.read_sql_query(query_3_4, connection)
industries

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

          id                                               name
0      7.540                Разработка программного обеспечения
1      7.539  Системная интеграция,  автоматизации технологи...
2     27.550              Безалкогольные напитки (производство)
3     27.551  Безалкогольные напитки (продвижение, оптовая т...
4     13.664             Управление и эксплуатация недвижимости
..       ...                                                ...
289   37.626             Ассоциация в сфере культуры, искусства
290   42.603                              Табак  (производство)
291   29.532                           Рыболовство, рыбоводство
292   37.627                      Благотворительная организация
293  388.505  Оборудование для деревообработки, заготовки ле...

[294 rows x 2 columns]

In [893]:
# результат запроса
print(industries["id"].count())

294

***

In [894]:
# выводы по предварительному анализу данных
# На данный момент в базе 294 разных сфер деятельности в 1362 регионах по которой 49197 вакансий и 23501 работодателей.

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [895]:
# текст запроса
query_4_1 = f'''select a.name, count(*)
                from public.areas a 
                join public.vacancies v on v.area_id = a.id
                group by 1
                order by 2 desc
'''

In [896]:
# результат запроса
area_num_of_vacan = pd.read_sql_query(query_4_1, connection)
area_num_of_vacan

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

                name  count
0             Москва   5333
1    Санкт-Петербург   2851
2              Минск   2112
3        Новосибирск   2006
4             Алматы   1892
..               ...    ...
764       Тарко-Сале      1
765    Новоаннинский      1
766            Бирск      1
767           Сасово      1
768             Анна      1

[769 rows x 2 columns]

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [897]:
# текст запроса
query_4_2 = f'''select*
                from public.vacancies
                where (salary_from is not null) or (salary_to is not null)
                
'''

In [898]:
# результат запроса
salary_notnull = pd.read_sql_query(query_4_2, connection)
salary_notnull

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

,id,name,key_skills,schedule,experience,employment,salary_from,salary_to,area_id,employer_id
0,55312386,Компьютерный Мастер,Пользователь ПК\tРабота в команде\tРемонт ноут...,Полный день,Нет опыта,Полная занятость,64000.0,NaN,1516,5724811
1,55354053,Специалист службы поддержки с техническими зна...,None,Удаленная работа,Нет опыта,Частичная занятость,15000.0,NaN,1955,1740
2,55050261,Инженер-программист,Java SE\tSpring Framework\tSpring Boot\tGit\tS...,Полный день,Нет опыта,Полная занятость,40000.0,60000.0,49,4448636
3,55583432,Системный администратор,Linux\tАдминистрирование сетевого оборудования...,Полный день,От 1 года до 3 лет,Полная занятость,50000.0,NaN,3,55126
4,55471342,Ведущий программист 1C,PostgreSQL\tSQL\tLinux\t1С программирование\tM...,Удаленная работа,От 3 до 6 лет,Полная занятость,150000.0,NaN,2813,3682876
...,...,...,...,...,...,...,...,...,...,...
24068,55874997,Специалист сопровождения медицинской информаци...,Аналитическое мышление\tИнформационные техноло...,Полный день,Нет опыта,Полная занятость,50000.0,NaN,2,1062575
24069,55291789,Аналитик бизнес-процессов,Моделирование бизнес процессов\tРазработка тех...,Полный день,От 1 года до 3 лет,Полная занятость,102500.0,NaN,2077,2173850
24070,51883918,Технический писатель (Платформа СБИС),Деловая переписка\tПрограммирование\tТехническ...,Полный день,Нет опыта,Полная занятость,40000.0,78000.0,99,67611
24071,66172263,Начальник сервисной службы,Организаторские навыки\tУправление персоналом\...,Полный день,От 1 года до 3 лет,Полная занятость,60000.0,NaN,1930,4094700
24072,66180086,Senior IOS разработчик,Swift\tRealm\tiOS\tАнглийский язык\tMVP\tMVVM\...,Полный день,От 1 года до 3 лет,Полная занятость,146456.0,244094.0,160,4469939

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [899]:
# текст запроса
query_4_3 = f'''select avg(salary_from), 
                avg(salary_to)
                from public.vacancies
                
                '''

In [900]:
# результат запроса
avg_salary = pd.read_sql_query(query_4_3, connection)
round(avg_salary)

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

       avg       avg
0  71065.0  110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [901]:
# текст запроса
query_4_4 = f'''select schedule, 
                employment,
                count(*)
                from public.vacancies
                group by 1,2
                order by 3 desc
                
                '''

In [902]:
# результат запроса
schedule_employment = pd.read_sql_query(query_4_4, connection)
schedule_employment

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

            schedule           employment  count
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [903]:
# текст запроса
query_4_5 = f'''select experience,
                count(*)
                from public.vacancies
                group by 1
                order by 2
                
                '''

In [904]:
# результат запроса
experience_count = pd.read_sql_query(query_4_5, connection)
experience_count

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

In [905]:
# выводы по детальному анализу вакансий
# Наибольшее количество вакансий в регионах - Москва, Санкт-Петербург, Минск, Новосибирск, Алматы. 
# Опираясь на уровень заработной плате, можно сделать вывод что средние значения для нижней границы 71.065 руб. и верхней 110.537 руб. по данным примерно половины вакансий. 
# Самый популярный тип трудоустройства «Полная занятость» при удаленном или полном рабочем дне и опытом работы от 1 до 3 лет, а также от 3 до 6 лет

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [906]:
# текст запроса
query_5_1 = f'''(select e.name, count(*)
                from public.employers e 
                join public.vacancies v on v.employer_id = e.id
                group by 1
                order by 2 desc
                limit 1)
                union all
                (select e.name, count(*)
                from public.employers e 
                join public.vacancies v on v.employer_id = e.id
                group by 1
                order by 2 desc
                offset 4 limit 1)
                
                 
'''

In [907]:
# результат запроса
employers_vac_count = pd.read_sql_query(query_5_1, connection)
employers_vac_count

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

            name  count
0         Яндекс   1933
1  Газпром нефть    331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [908]:
# текст запроса
query_5_2 = f'''select a.name, count(distinct v.employer_id) as "total employers", count(v.id) as "total vacancies"
                from  public.vacancies v 
                join public.areas a on v.area_id = a.id
                join public.employers e on e.id = v.employer_id
                
                group by 1
                order by 2 desc
            
                '''
area_emp_vac = pd.read_sql_query(query_5_2, connection)
area_emp_vac

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

                name  total employers  total vacancies
0             Москва             2320             5333
1    Санкт-Петербург             1451             2851
2              Минск              851             2112
3        Новосибирск              802             2006
4             Алматы              798             1892
..               ...              ...              ...
764             Абан                1                1
765      Казачинское                1                1
766     Новая Усмань                1                1
767          Дербент                1                4
768             Руза                1                1

[769 rows x 3 columns]

In [941]:
# результат запроса
query_5_2_1 = f'''select a.name, count(e.id)
                from  public.areas a
                left join public.vacancies v on a.id = v.area_id
                left join public.employers e on e.id = v.employer_id
                where v.id is null
                group by 1
                order by 2
               
               
            
                '''
                
area_emp_vac1 = pd.read_sql_query(query_5_2_1, connection)
area_emp_vac1

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

                             name  count
0                        Абатское      0
1                       Австралия      0
2                           Агрыз      0
3                        Адамовка      0
4                        Адыгейск      0
..                            ...    ...
588    Ямбург (Ямало-Ненецкий АО)      0
589                       Янино-1      0
590           Ярославская область      0
591  Ясный (Оренбургская область)      0
592                        Яшкино      0

[593 rows x 2 columns]

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [946]:
# текст запроса
query_5_2_2 = f'''select*
                from  public.employers e
                left join public.vacancies v on e.id = v.employer_id
            
                where v.id is null
                
               
                
                
            
               
               
            
                '''
                
area_emp_vac2 = pd.read_sql_query(query_5_2_2, connection)
area_emp_vac2

c:\Users\pavel\AppData\Local\Programs\Python\Python39\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

,id,name,area,id,name,key_skills,schedule,experience,employment,salary_from,salary_to,area_id,employer_id
0,10295,Фитнес-клубы XFIT,1,None,None,None,None,None,None,None,None,None,None
1,3097282,Вертикаль,3,None,None,None,None,None,None,None,None,None,None
2,2603367,Нозиков Денис Михайлович,83,None,None,None,None,None,None,None,None,None,None
3,1161388,Центр Интенсивных технологий Образования,113,None,None,None,None,None,None,None,None,None,None
4,4483435,SiteAnalyzer,1,None,None,None,None,None,None,None,None,None,None
...,...,...,...,...,...,...,...,...,...,...,...,...,...
8590,4857976,ТК НикоТранс,1627,None,None,None,None,None,None,None,None,None,None
8591,5608833,Глобал Групп,1,None,None,None,None,None,None,None,None,None,None
8592,215771,СвязьИнформ,24,None,None,None,None,None,None,None,None,None,None
8593,5596143,ГОКУ ЦОСУМС,64,None,None,None,None,None,None,None,None,None,None
8594,2835381,Сыктывкарская Швейная Фабрика Текстиль Коми,51,None,None,None,None,None,None,None,None,None,None

In [939]:
# результат запроса

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [912]:
# текст запроса

In [913]:
# результат запроса

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [914]:
# текст запроса

In [915]:
# результат запроса

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [916]:
# текст запроса

In [917]:
# результат запроса

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [918]:
# код для получения списка городов-милионников

In [919]:
# текст запроса

In [920]:
# результат запроса

***

In [921]:
# выводы по анализу работодателей

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [922]:
# текст запроса

In [923]:
# результат запроса

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [924]:
# текст запроса

In [925]:
# результат запроса

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [926]:
# текст запроса

In [927]:
# результат запроса

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [928]:
# текст запроса

In [929]:
# результат запроса

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [930]:
# текст запроса

In [931]:
# результат запроса

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [932]:
# текст запроса

In [933]:
# результат запроса

***

In [934]:
# выводы по предметному анализу

# Общий вывод по проекту

In [935]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования